stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_rcc_ex.h
/**
  ******************************************************************************
  * @file    stm32u0xx_hal_rcc_ex.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL Extended module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32U0xx_HAL_RCC_EX_H
#define __STM32U0xx_HAL_RCC_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u0xx_hal_def.h"

/** @addtogroup STM32U0xx_HAL_Driver
  * @{
  */

/** @addtogroup RCCEx
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup RCCEx_Exported_Types RCCEx Exported Types
  * @{
  */

/**
  * @brief  RCC PLL Clocks structure definition
  */
typedef struct
{
  uint32_t PLL_P_Frequency;
  uint32_t PLL_Q_Frequency;
  uint32_t PLL_R_Frequency;
} PLL_ClocksTypeDef;

/**
  * @brief  RCC extended clocks structure definition
  */
typedef struct
{
  uint32_t PeriphClockSelection;                /*!< The Extended Clock to be configured.
                                                This parameter can be a value of @ref RCCEx_Periph_Clock_Selection */

  uint32_t Usart1ClockSelection;                /*!< Specifies USART1 clock source.
                                                This parameter can be a value of @ref RCCEx_USART1_Clock_Source */

  uint32_t Usart2ClockSelection;                /*!< Specifies USART2 clock source.
                                                This parameter can be a value of @ref RCCEx_USART2_Clock_Source */
#if defined (LPUART3)
  uint32_t Lpuart3ClockSelection;               /*!< Specifies LPUART1 clock source.
                                                This parameter can be a value of @ref RCCEx_LPUART3_Clock_Source */
#endif /* LPUART3 */
  uint32_t Lpuart2ClockSelection;               /*!< Specifies LPUART2 clock source.
                                                This parameter can be a value of @ref RCCEx_LPUART2_Clock_Source */

  uint32_t Lpuart1ClockSelection;               /*!< Specifies LPUART3 clock source.
                                                This parameter can be a value of @ref RCCEx_LPUART1_Clock_Source */

  uint32_t I2c1ClockSelection;                  /*!< Specifies I2C1 clock source.
                                                This parameter can be a value of @ref RCCEx_I2C1_Clock_Source */

  uint32_t I2c3ClockSelection;                  /*!< Specifies I2C3 clock source.
                                                This parameter can be a value of @ref RCCEx_I2C3_Clock_Source */

  uint32_t Lptim1ClockSelection;                /*!< Specifies LPTIM1 clock source.
                                                This parameter can be a value of @ref RCCEx_LPTIM1_Clock_Source */

  uint32_t Lptim2ClockSelection;                /*!< Specifies LPTIM2 clock source.
                                                This parameter can be a value of @ref RCCEx_LPTIM2_Clock_Source */
#if defined (LPTIM3)
  uint32_t Lptim3ClockSelection;                /*!< Specifies LPTIM3 clock source.
                                                This parameter can be a value of @ref RCCEx_LPTIM3_Clock_Source */
#endif /* LPTIM3 */
  uint32_t Tim1ClockSelection;                  /*!< Specifies TIM1 clock source.
                                                This parameter can be a value of @ref RCCEx_TIM1_Clock_Source */

  uint32_t Tim15ClockSelection;                 /*!< Specifies TIM15 clock source.
                                                This parameter can be a value of @ref RCCEx_TIM15_Clock_Source */
#if defined(USB_DRD_FS)
  uint32_t UsbClockSelection;                   /*!< Specifies USB clock source.
                                                This parameter can be a value of @ref RCCEx_USB_Clock_Source */
#endif /* USB_DRD_FS */
  uint32_t RngClockSelection;                   /*!< Specifies RNG clock source.
                                                This parameter can be a value of @ref RCCEx_RNG_Clock_Source */

  uint32_t AdcClockSelection;                   /*!< Specifies ADC clock source.
                                                This parameter can be a value of @ref RCCEx_ADC_Clock_Source */

  uint32_t RTCClockSelection;                   /*!< Specifies RTC clock source.
                                                This parameter can be a value of @ref RCC_RTC_Clock_Source */
} RCC_PeriphCLKInitTypeDef;

#if defined (CRS)
/**
  * @brief RCC_CRS Init structure definition
  */
typedef struct
{
  uint32_t Prescaler;               /*!< Specifies the division factor of the SYNC signal.
                                      This parameter can be a value of @ref RCCEx_CRS_SynchroDivider */

  uint32_t Source;                  /*!< Specifies the SYNC signal source.
                                      This parameter can be a value of @ref RCCEx_CRS_SynchroSource */

  uint32_t Polarity;                /*!< Specifies the input polarity for the SYNC signal source.
                                      This parameter can be a value of @ref RCCEx_CRS_SynchroPolarity */

  uint32_t ReloadValue;             /*!< Specifies the value to be loaded in the frequency error counter with each SYNC
                                      event. It can be calculated in using macro
                                      @ref __HAL_RCC_CRS_RELOADVALUE_CALCULATE(__FTARGET__, __FSYNC__)
                                      This parameter must be a number between 0 and 0xFFFF or a value of
                                      @ref RCCEx_CRS_ReloadValueDefault .*/

  uint32_t ErrorLimitValue;         /*!< Specifies the value to be used to evaluate the captured frequency error value.
                                       This parameter must be a number between 0 and 0xFF or a value of
                                       @ref RCCEx_CRS_ErrorLimitDefault */

  uint32_t HSI48CalibrationValue;   /*!< Specifies a user-programmable trimming value to the HSI48 oscillator.
                                      This parameter must be a number between 0 and 0x3F or a value of
                                      @ref RCCEx_CRS_HSI48CalibrationDefault */

} RCC_CRSInitTypeDef;

/**
  * @brief RCC_CRS Synchronization structure definition
  */
typedef struct
{
  uint32_t ReloadValue;                   /*!< Specifies the value loaded in the Counter reload value.
                                            This parameter must be a number between 0 and 0xFFFF */

  uint32_t HSI48CalibrationValue;         /*!< Specifies value loaded in RC48 oscillator smooth trimming.
                                            This parameter must be a number between 0 and 0x3F */

  uint32_t FreqErrorCapture;              /*!< Specifies the value loaded in the .FECAP, the frequency error counter
                                            value latched in the time of the last SYNC event.
                                            This parameter must be a number between 0 and 0xFFFF */

  uint32_t FreqErrorDirection;            /*!< Specifies the value loaded in the .FEDIR, the counting direction of the
                                            frequency error counter latched in the time of the last SYNC event.
                                            It shows whether the actual frequency is below or above the target.
                                            This parameter must be a value of @ref RCCEx_CRS_FreqErrorDirection */

} RCC_CRSSynchroInfoTypeDef;

#endif /* CRS */
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Constants RCCEx Exported Constants
  * @{
  */

