stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_rcc_ex.h
void              HAL_RCCEx_CRSConfig(const RCC_CRSInitTypeDef *const pInit);
void              HAL_RCCEx_CRSSoftwareSynchronizationGenerate(void);
void              HAL_RCCEx_CRSGetSynchronizationInfo(RCC_CRSSynchroInfoTypeDef *pSynchroInfo);
uint32_t          HAL_RCCEx_CRSWaitSynchronization(uint32_t Timeout);
void              HAL_RCCEx_CRS_IRQHandler(void);
void              HAL_RCCEx_CRS_SyncOkCallback(void);
void              HAL_RCCEx_CRS_SyncWarnCallback(void);
void              HAL_RCCEx_CRS_ExpectedSyncCallback(void);
void              HAL_RCCEx_CRS_ErrorCallback(uint32_t Error);

/**
  * @}
  */

#endif /* CRS */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @addtogroup RCCEx_Private_Macros
  * @{
  */

#define IS_RCC_LSCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_LSCOSOURCE_LSI) || \
                                       ((__SOURCE__) == RCC_LSCOSOURCE_LSE))
#if (defined (LPUART3) || defined (LPTIM3) || defined (USB_DRD_FS))
#define RCC_PERIPHCLOCK_ALL (RCC_PERIPHCLK_USART1  | RCC_PERIPHCLK_USART2  | \
                             RCC_PERIPHCLK_USART3  | RCC_PERIPHCLK_USART4  | \
                             RCC_PERIPHCLK_LPUART1 | RCC_PERIPHCLK_LPUART2 | \
                             RCC_PERIPHCLK_LPUART3 | RCC_PERIPHCLK_I2C1    | \
                             RCC_PERIPHCLK_I2C3    | RCC_PERIPHCLK_LPTIM1  | \
                             RCC_PERIPHCLK_LPTIM2  | RCC_PERIPHCLK_LPTIM3  | \
                             RCC_PERIPHCLK_TIM1    | RCC_PERIPHCLK_TIM15   | \
                             RCC_PERIPHCLK_USB     | RCC_PERIPHCLK_RNG     | \
                             RCC_PERIPHCLK_RTC     | RCC_PERIPHCLK_ADC)
#else
#define RCC_PERIPHCLOCK_ALL (RCC_PERIPHCLK_USART1  | RCC_PERIPHCLK_USART2  | \
                             RCC_PERIPHCLK_USART3  | RCC_PERIPHCLK_USART4  | \
                             RCC_PERIPHCLK_LPUART1 | RCC_PERIPHCLK_LPUART2 | \
                             RCC_PERIPHCLK_I2C1    |  RCC_PERIPHCLK_I2C3   | \
                             RCC_PERIPHCLK_LPTIM1  | RCC_PERIPHCLK_LPTIM2  | \
                             RCC_PERIPHCLK_TIM1    | RCC_PERIPHCLK_TIM15   | \
                             RCC_PERIPHCLK_RNG     | RCC_PERIPHCLK_RTC     | \
                             RCC_PERIPHCLK_ADC)
#endif /* LPUART3 | LPTIM3 | USB_DRD_FS */
#define IS_RCC_PERIPHCLOCK(__SELECTION__)  ((((__SELECTION__) & RCC_PERIPHCLOCK_ALL) != (0x00U)) && \
                                            (((__SELECTION__) & ~RCC_PERIPHCLOCK_ALL) == (0x00U)))
#define IS_RCC_USART1CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_USART1CLKSOURCE_PCLK1)  || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_SYSCLK) || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_HSI)    || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_LSE))

#define IS_RCC_USART2CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_USART2CLKSOURCE_PCLK1)  || \
   ((__SOURCE__) == RCC_USART2CLKSOURCE_SYSCLK) || \
   ((__SOURCE__) == RCC_USART2CLKSOURCE_HSI)    || \
   ((__SOURCE__) == RCC_USART2CLKSOURCE_LSE))

#define IS_RCC_LPUART1CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_LPUART1CLKSOURCE_PCLK1)  || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_SYSCLK) || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_HSI)    || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_LSE))

#define IS_RCC_LPUART2CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_LPUART2CLKSOURCE_PCLK1)  || \
   ((__SOURCE__) == RCC_LPUART2CLKSOURCE_SYSCLK) || \
   ((__SOURCE__) == RCC_LPUART2CLKSOURCE_HSI)    || \
   ((__SOURCE__) == RCC_LPUART2CLKSOURCE_LSE))
#if defined (LPUART3)
#define IS_RCC_LPUART3CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_LPUART3CLKSOURCE_PCLK1)  || \
   ((__SOURCE__) == RCC_LPUART3CLKSOURCE_SYSCLK) || \
   ((__SOURCE__) == RCC_LPUART3CLKSOURCE_HSI)    || \
   ((__SOURCE__) == RCC_LPUART3CLKSOURCE_LSE))
#endif /* LPUART3 */
#define IS_RCC_I2C1CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_I2C1CLKSOURCE_PCLK1)  || \
   ((__SOURCE__) == RCC_I2C1CLKSOURCE_SYSCLK) || \
   ((__SOURCE__) == RCC_I2C1CLKSOURCE_HSI))

#define IS_RCC_I2C2CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_I2C2CLKSOURCE_PCLK1)  || \
   ((__SOURCE__) == RCC_I2C2CLKSOURCE_SYSCLK) || \
   ((__SOURCE__) == RCC_I2C2CLKSOURCE_HSI))

#define IS_RCC_I2C3CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_I2C3CLKSOURCE_PCLK1)  || \
   ((__SOURCE__) == RCC_I2C3CLKSOURCE_SYSCLK) || \
   ((__SOURCE__) == RCC_I2C3CLKSOURCE_HSI))

#define IS_RCC_LPTIM1CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_LPTIM1CLKSOURCE_PCLK1)  || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_HSI)    || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSI)    || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSE))

#define IS_RCC_LPTIM2CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_LPTIM2CLKSOURCE_PCLK1)|| \
   ((__SOURCE__) == RCC_LPTIM2CLKSOURCE_HSI)  || \
   ((__SOURCE__) == RCC_LPTIM2CLKSOURCE_LSI)  || \
   ((__SOURCE__) == RCC_LPTIM2CLKSOURCE_LSE))
#if defined (LPTIM3)
#define IS_RCC_LPTIM3CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_LPTIM3CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_LPTIM3CLKSOURCE_LSI)   || \
   ((__SOURCE__) == RCC_LPTIM3CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_LPTIM3CLKSOURCE_LSE))
#endif /* LPTIM3 */
#define IS_RCC_TIM1CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_TIM1CLKSOURCE_PCLK1)   || \
   ((__SOURCE__) == RCC_TIM1CLKSOURCE_PLLQ))
#if defined (USB_DRD_FS)
#define IS_RCC_USBCLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_USBCLKSOURCE_NONE)  || \
   ((__SOURCE__) == RCC_USBCLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_USBCLKSOURCE_PLLQ)  || \
   ((__SOURCE__) == RCC_USBCLKSOURCE_HSI48))
#endif /* USB_DRD_FS */
#if defined(RCC_RNGCLKSOURCE_HSI48)
#define IS_RCC_RNGCLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_RNGCLKSOURCE_NONE)  || \
   ((__SOURCE__) == RCC_RNGCLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_RNGCLKSOURCE_PLLQ)  || \
   ((__SOURCE__) == RCC_RNGCLKSOURCE_HSI48))
#else
#define IS_RCC_RNGCLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_RNGCLKSOURCE_NONE)  || \
   ((__SOURCE__) == RCC_RNGCLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_RNGCLKSOURCE_PLLQ))
#endif /* RCC_CRRCR_HSI48ON */
#define IS_RCC_TIM15CLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_TIM15CLKSOURCE_PCLK1)  || \
   ((__SOURCE__) == RCC_TIM15CLKSOURCE_PLLQ))

#define IS_RCC_ADCCLKSOURCE(__SOURCE__)  \
  (((__SOURCE__) == RCC_ADCCLKSOURCE_SYSCLK)|| \
   ((__SOURCE__) == RCC_ADCCLKSOURCE_PLLP)  || \
   ((__SOURCE__) == RCC_ADCCLKSOURCE_HSI))

#if defined(CRS)

#define IS_RCC_CRS_SYNC_SOURCE(__SOURCE__) (((__SOURCE__) == RCC_CRS_SYNC_SOURCE_GPIO) || \
                                            ((__SOURCE__) == RCC_CRS_SYNC_SOURCE_LSE)  || \
                                            ((__SOURCE__) == RCC_CRS_SYNC_SOURCE_USB))

#define IS_RCC_CRS_SYNC_DIV(__DIV__)       (((__DIV__) == RCC_CRS_SYNC_DIV1)  || ((__DIV__) == RCC_CRS_SYNC_DIV2)  || \
                                            ((__DIV__) == RCC_CRS_SYNC_DIV4)  || ((__DIV__) == RCC_CRS_SYNC_DIV8)  || \
                                            ((__DIV__) == RCC_CRS_SYNC_DIV16) || ((__DIV__) == RCC_CRS_SYNC_DIV32) || \
                                            ((__DIV__) == RCC_CRS_SYNC_DIV64) || ((__DIV__) == RCC_CRS_SYNC_DIV128))

#define IS_RCC_CRS_SYNC_POLARITY(__POLARITY__) (((__POLARITY__) == RCC_CRS_SYNC_POLARITY_RISING) || \
                                                ((__POLARITY__) == RCC_CRS_SYNC_POLARITY_FALLING))

#define IS_RCC_CRS_RELOADVALUE(__VALUE__)  (((__VALUE__) <= 0xFFFFU))

#define IS_RCC_CRS_ERRORLIMIT(__VALUE__)   (((__VALUE__) <= 0xFFU))

#define IS_RCC_CRS_HSI48CALIBRATION(__VALUE__) (((__VALUE__) <= 0x7FU))

#define IS_RCC_CRS_FREQERRORDIR(__DIR__)   (((__DIR__) == RCC_CRS_FREQERRORDIR_UP) || \
                                            ((__DIR__) == RCC_CRS_FREQERRORDIR_DOWN))

#endif /* CRS */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32U0xx_HAL_RCC_EX_H */
